{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4b1415a6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in c:\\users\\user\\anaconda3\\lib\\site-packages (5.12.0)\n",
      "Requirement already satisfied: pytz in c:\\users\\user\\anaconda3\\lib\\site-packages (from neo4j) (2023.3.post1)\n",
      "Requirement already satisfied: langchain in c:\\users\\user\\anaconda3\\lib\\site-packages (0.0.310)\n",
      "Requirement already satisfied: PyYAML>=5.3 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (6.0)\n",
      "Requirement already satisfied: SQLAlchemy<3,>=1.4 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (2.0.21)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (3.8.6)\n",
      "Requirement already satisfied: anyio<4.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (3.7.1)\n",
      "Requirement already satisfied: async-timeout<5.0.0,>=4.0.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (4.0.2)\n",
      "Requirement already satisfied: dataclasses-json<0.7,>=0.5.7 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (0.6.1)\n",
      "Requirement already satisfied: jsonpatch<2.0,>=1.33 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (1.33)\n",
      "Requirement already satisfied: langsmith<0.1.0,>=0.0.40 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (0.0.43)\n",
      "Requirement already satisfied: numpy<2,>=1 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (1.26.1)\n",
      "Requirement already satisfied: pydantic<3,>=1 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (1.10.12)\n",
      "Requirement already satisfied: requests<3,>=2 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (2.31.0)\n",
      "Requirement already satisfied: tenacity<9.0.0,>=8.1.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from langchain) (8.2.2)\n",
      "Requirement already satisfied: attrs>=17.3.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (23.1.0)\n",
      "Requirement already satisfied: charset-normalizer<4.0,>=2.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (2.0.4)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in c:\\users\\user\\anaconda3\\lib\\site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (6.0.4)\n",
      "Requirement already satisfied: yarl<2.0,>=1.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.9.2)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in c:\\users\\user\\anaconda3\\lib\\site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.4.0)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in c:\\users\\user\\anaconda3\\lib\\site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.3.1)\n",
      "Requirement already satisfied: idna>=2.8 in c:\\users\\user\\anaconda3\\lib\\site-packages (from anyio<4.0->langchain) (3.4)\n",
      "Requirement already satisfied: sniffio>=1.1 in c:\\users\\user\\anaconda3\\lib\\site-packages (from anyio<4.0->langchain) (1.2.0)\n",
      "Requirement already satisfied: exceptiongroup in c:\\users\\user\\anaconda3\\lib\\site-packages (from anyio<4.0->langchain) (1.0.4)\n",
      "Requirement already satisfied: marshmallow<4.0.0,>=3.18.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from dataclasses-json<0.7,>=0.5.7->langchain) (3.20.1)\n",
      "Requirement already satisfied: typing-inspect<1,>=0.4.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from dataclasses-json<0.7,>=0.5.7->langchain) (0.9.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in c:\\users\\user\\anaconda3\\lib\\site-packages (from jsonpatch<2.0,>=1.33->langchain) (2.1)\n",
      "Requirement already satisfied: typing-extensions>=4.2.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from pydantic<3,>=1->langchain) (4.7.1)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in c:\\users\\user\\anaconda3\\lib\\site-packages (from requests<3,>=2->langchain) (2.0.7)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\users\\user\\anaconda3\\lib\\site-packages (from requests<3,>=2->langchain) (2023.7.22)\n",
      "Requirement already satisfied: greenlet!=0.4.17 in c:\\users\\user\\anaconda3\\lib\\site-packages (from SQLAlchemy<3,>=1.4->langchain) (2.0.1)\n",
      "Requirement already satisfied: packaging>=17.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from marshmallow<4.0.0,>=3.18.0->dataclasses-json<0.7,>=0.5.7->langchain) (23.1)\n",
      "Requirement already satisfied: mypy-extensions>=0.3.0 in c:\\users\\user\\anaconda3\\lib\\site-packages (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain) (1.0.0)\n"
     ]
    }
   ],
   "source": [
    "!pip install neo4j\n",
    "from yfiles_jupyter_graphs import GraphWidget\n",
    "! pip install langchain\n",
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.graphs import Neo4jGraph\n",
    "from langchain.prompts.prompt import PromptTemplate\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "465531cf",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "class DataLoader:\n",
    "    def __init__(self, uri, user, password, llm):\n",
    "        self._driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "        self.graph = Neo4jGraph(url=uri, username=user, password=password)\n",
    "        self.llm = llm\n",
    "        self.cypher_generation_prompt = self.create_cypher_generation_prompt()\n",
    "        self.chain = None  # Initialize to None, will be set in create_chain()\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "\n",
    "    def run_query(self, query, params=None):\n",
    "        with self._driver.session() as session:\n",
    "            session.run(query, params)\n",
    "            \n",
    "    def run_query_and_return(self, query, params=None):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.run(query, params)\n",
    "            return [record for record in result]\n",
    "        \n",
    "    def run_query_and_return_graph(self, query, params=None):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.run(query, params)\n",
    "            return result.graph()\n",
    "\n",
    "    def get_schema(self):\n",
    "        def transaction(tx):\n",
    "            result = tx.run(\"CALL db.schema.visualization()\")\n",
    "            return result.data()\n",
    "\n",
    "        with self._driver.session() as session:\n",
    "            schema_data = session.read_transaction(transaction)\n",
    "            return schema_data\n",
    "\n",
    "    def create_cypher_generation_prompt(self):\n",
    "        cypher_generation_template = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "        Instructions:\n",
    "        Use only the provided relationship types and properties in the schema.\n",
    "        Do not use any other relationship types or properties that are not provided.\n",
    "        Schema:\n",
    "        {schema}\n",
    "        Note: Do not include any explanations or apologies in your responses.\n",
    "        Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "        Do not include any text except the generated Cypher statement.\n",
    "\n",
    "        The question is:\n",
    "        {question}\"\"\"\n",
    "\n",
    "        return PromptTemplate(\n",
    "            input_variables=[\"schema\", \"question\"], template=cypher_generation_template\n",
    "        )\n",
    "\n",
    "    def create_chain(self):\n",
    "        self.chain = GraphCypherQAChain.from_llm(\n",
    "            llm=self.llm,\n",
    "            graph=self.graph,\n",
    "            verbose=True,\n",
    "            cypher_prompt=self.cypher_generation_prompt\n",
    "        )\n",
    "\n",
    "    def run_chain_query(self, query):\n",
    "        if self.chain is None:\n",
    "            self.create_chain()\n",
    "        return self.chain.run(query)\n",
    "\n",
    "# Usage:\n",
    "uri = 'bolt://localhost:7687'\n",
    "username = 'neo4j'\n",
    "password = ''\n",
    "openai_api_key = \"\"\n",
    "llm = ChatOpenAI(openai_api_key=openai_api_key, temperature=0)\n",
    "\n",
    "# Initialize the DataLoader\n",
    "loader = DataLoader(uri, username, password, llm)\n",
    "\n",
    "\n",
    "# Don't forget to close the connection when done\n",
    "# loader.close()\n",
    "\n",
    "# Set parameters\n",
    "params = {\n",
    "    \"file_path_root\": \"file:///\",\n",
    "    \"idsToSkip\": []\n",
    "}\n",
    "\n",
    "# Run the constraint creation queries\n",
    "constraint_queries = [\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Territory_territoryID` IF NOT EXISTS FOR (n: `Territory`) REQUIRE (n.`territoryID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Region_regionID` IF NOT EXISTS FOR (n: `Region`) REQUIRE (n.`regionID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Supplier_supplierID` IF NOT EXISTS FOR (n: `Supplier`) REQUIRE (n.`supplierID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Shipper_shipperID` IF NOT EXISTS FOR (n: `Shipper`) REQUIRE (n.`shipperID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Product_productID` IF NOT EXISTS FOR (n: `Product`) REQUIRE (n.`productID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Category_categoryID` IF NOT EXISTS FOR (n: `Category`) REQUIRE (n.`categoryID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Order_orderID` IF NOT EXISTS FOR (n: `Order`) REQUIRE (n.`orderID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Customer_customerID` IF NOT EXISTS FOR (n: `Customer`) REQUIRE (n.`customerID`) IS UNIQUE\",\n",
    "    \"CREATE CONSTRAINT `imp_uniq_Employee_employeeID` IF NOT EXISTS FOR (n: `Employee`) REQUIRE (n.`employeeID`) IS UNIQUE\"\n",
    "]\n",
    "\n",
    "for query in constraint_queries:\n",
    "    loader.run_query(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6b7551e4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# List of queries for loading each type of node\n",
    "queries = [\n",
    "    # Load Territories\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"territories.csv\" AS row RETURN row',\n",
    "        'MERGE (n:Territory {territoryID: row.territoryID}) SET n.territoryDescription = row.territoryDescription',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Regions\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"regions.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`regionID` IS NULL AND NOT row.`regionID` IN $idsToSkip MERGE (n:Region {regionID: row.regionID}) SET n.regionDescription = row.regionDescription',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Suppliers\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"suppliers.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`supplierID` IS NULL AND NOT row.`supplierID` IN $idsToSkip MERGE (n:Supplier {supplierID: row.supplierID}) SET n.companyName = row.companyName, n.contactName = row.contactName, n.contactTitle = row.contactTitle, n.address = row.address, n.city = row.city, n.region = row.region, n.postalCode = row.postalCode, n.country = row.country, n.phone = row.phone, n.fax = row.fax, n.homePage = row.homePage',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Shippers\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"shippers.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`shipperID` IS NULL AND NOT row.`shipperID` IN $idsToSkip MERGE (n:Shipper {shipperID: row.shipperID}) SET n.companyName = row.companyName, n.phone = row.phone',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Products\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"products.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`productID` IS NULL AND NOT row.`productID` IN $idsToSkip MERGE (n:Product {productID: row.productID}) SET n.productName = row.productName, n.quantityPerUnit = toInteger(trim(row.quantityPerUnit)), n.unitPrice = toFloat(trim(row.unitPrice)), n.unitsInStock = toInteger(trim(row.unitsInStock)), n.unitsOnOrder = toInteger(trim(row.unitsOnOrder)), n.reorderLevel = toInteger(trim(row.reorderLevel)), n.discontinued = toLower(trim(row.discontinued)) IN [\"1\", \"true\", \"yes\"]',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Categories\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"categories.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`categoryID` IS NULL AND NOT row.`categoryID` IN $idsToSkip MERGE (n:Category {categoryID: row.categoryID}) SET n.categoryName = row.categoryName, n.description = row.description',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Orders\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"orders.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`orderID` IS NULL AND NOT row.`orderID` IN $idsToSkip MERGE (n:Order {orderID: row.orderID}) SET n.orderDate = row.orderDate, n.requiredDate = row.requiredDate, n.shippedDate = row.shippedDate, n.freight = row.freight, n.shipName = row.shipName, n.shipAddress = row.shipAddress, n.shipCity = row.shipCity, n.shipRegion = row.shipRegion, n.shipPostalCode = row.shipPostalCode, n.shipCountry = row.shipCountry',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Customers\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"customers.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`customerID` IS NULL AND NOT row.`customerID` IN $idsToSkip MERGE (n:Customer {customerID: row.customerID}) SET n.companyName = row.companyName, n.contactName = row.contactName, n.contactTitle = row.contactTitle, n.address = row.address, n.city = row.city, n.region = row.region, n.postalCode = row.postalCode, n.country = row.country, n.phone = row.phone, n.fax = row.fax',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load Employees\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"employees.csv\" AS row RETURN row',\n",
    "        'WITH row WHERE NOT row.`employeeID` IS NULL AND NOT row.`employeeID` IN $idsToSkip MERGE (n:Employee {employeeID: row.employeeID}) SET n.lastName = row.lastName, n.firstName = row.firstName, n.title = row.title, n.titleOfCourtesy = row.titleOfCourtesy, n.birthDate = row.birthDate, n.hireDate = row.hireDate, n.address = row.address, n.city = row.city, n.region = row.region, n.postalCode = row.postalCode, n.country = row.country, n.homePhone = row.homePhone, n.extension = row.extension, n.notes = row.notes, n.photoPath = row.photoPath',\n",
    "        {batchSize: 100, params: {file: $file_path_root, idsToSkip: $idsToSkip}, parallel: true}\n",
    "    )\n",
    "    '''\n",
    "]\n",
    "\n",
    "# Run each query\n",
    "for query in queries:\n",
    "    loader.run_query(query, params)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "c23667ba",
   "metadata": {},
   "outputs": [],
   "source": [
    "relationship_queries = [\n",
    "    # Load IN_REGION relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"territories.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Territory {territoryID: row.territoryID})\n",
    "         MATCH (target:Region {regionID: row.regionID})\n",
    "         MERGE (source)-[r:IN_REGION]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load SUPPLIES relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"products.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Supplier {supplierID: row.supplierID})\n",
    "         MATCH (target:Product {productID: row.productID})\n",
    "         MERGE (source)-[r:SUPPLIES]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load PART_OF relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"products.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Product {productID: row.productID})\n",
    "         MATCH (target:Category {categoryID: row.categoryID})\n",
    "         MERGE (source)-[r:PART_OF]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load SHIPS relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"orders.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Shipper {shipperID: row.shipVia})\n",
    "         MATCH (target:Order {orderID: row.orderID})\n",
    "         MERGE (source)-[r:SHIPS]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load PURCHASED relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"orders.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Customer {customerID: row.customerID})\n",
    "         MATCH (target:Order {orderID: row.orderID})\n",
    "         MERGE (source)-[r:PURCHASED]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load SOLD relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"orders.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Employee {employeeID: row.employeeID})\n",
    "         MATCH (target:Order {orderID: row.orderID})\n",
    "         MERGE (source)-[r:SOLD]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load REPORTS_TO relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"employees.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Employee {employeeID: row.employeeID})\n",
    "         MATCH (target:Employee {employeeID: row.reportsTo})\n",
    "         MERGE (source)-[r:REPORTS_TO]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load IN_TERRITORY relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'LOAD CSV WITH HEADERS FROM $file + \"employee-territories.csv\" AS row RETURN row',\n",
    "        'WITH row \n",
    "         MATCH (source:Employee {employeeID: row.employeeID})\n",
    "         MATCH (target:Territory {territoryID: row.territoryID})\n",
    "         MERGE (source)-[r:IN_TERRITORY]->(target)',\n",
    "        {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    ''',\n",
    "    # Load ORDERS relationships\n",
    "    '''\n",
    "    CALL apoc.periodic.iterate(\n",
    "      'LOAD CSV WITH HEADERS FROM $file + \"order-details.csv\" AS row RETURN row',\n",
    "      'MATCH (source:Order {orderID: row.orderID}) \n",
    "       MATCH (target:Product {productID: row.productID}) \n",
    "       MERGE (source)-[r:ORDERS]->(target) \n",
    "       SET r.unitPrice = toFloat(trim(row.unitPrice)),\n",
    "           r.quantity = toInteger(trim(row.quantity)),\n",
    "           r.discount = toFloat(trim(row.discount))',\n",
    "      {batchSize: 100, params: {file: $file_path_root}, parallel: true}\n",
    "    )\n",
    "    '''\n",
    "]\n",
    "\n",
    "\n",
    "# Run each relationship query\n",
    "for query in relationship_queries:\n",
    "    loader.run_query(query, params)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "e3a02e09",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Additional direct relationship queries\n",
    "direct_relationship_queries = [\n",
    "    # Create direct relationship from Customer to Category\n",
    "    '''\n",
    "    MATCH (c:Customer)-[:PURCHASED]->(:Order)-[:ORDERS]->(:Product)-[:PART_OF]->(cat:Category)\n",
    "    MERGE (c)-[:BUYS_FROM_CATEGORY]->(cat)\n",
    "    ''',\n",
    "    \n",
    "    # Create direct relationship from Customer to Product bypassing the mediating Order nodes\n",
    "    '''\n",
    "    MATCH (c:Customer)-[:PURCHASED]->(:Order)-[:ORDERS]->(p:Product)\n",
    "    MERGE (c)-[:BUYS_PRODUCT]->(p)\n",
    "    '''\n",
    "    ,\n",
    "     # Convert the customer-product-customer to weighted customer - customer\n",
    "    '''\n",
    "    MATCH (c1:Customer)-[:BUYS_PRODUCT]->(p:Product)<-[:BUYS_PRODUCT]-(c2:Customer)\n",
    "    WHERE c1 <> c2 AND id(c1) < id(c2)\n",
    "    WITH c1, c2, COUNT(DISTINCT p) AS sharedProducts\n",
    "    MERGE (c1)-[r:SHARED_PURCHASE]->(c2)\n",
    "    SET r.weight = sharedProducts\n",
    "    '''\n",
    "]\n",
    "\n",
    "\n",
    "# Run each direct relationship query\n",
    "for query in direct_relationship_queries:\n",
    "    loader.run_query(query, {})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4340cb1a",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Query to project the graph for community detection\n",
    "project_graph_query = '''\n",
    "CALL gds.graph.project(\n",
    "    'customer_community_graph',\n",
    "    {\n",
    "        Customer: {\n",
    "            label: 'Customer',\n",
    "            properties: {}\n",
    "        }\n",
    "    },\n",
    "    {\n",
    "        SHARED_PURCHASE: {\n",
    "            type: 'SHARED_PURCHASE',\n",
    "            properties: 'weight',\n",
    "            orientation: 'UNDIRECTED'\n",
    "        }\n",
    "    }\n",
    ")\n",
    "'''\n",
    "\n",
    "# Run the query\n",
    "loader.run_query(project_graph_query, {})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "a92d618b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query to run the Louvain algorithm\n",
    "louvain_algorithm_query = '''\n",
    "CALL gds.louvain.write('customer_community_graph', {\n",
    "    relationshipWeightProperty: 'weight',\n",
    "    writeProperty: 'community'\n",
    "})\n",
    "'''\n",
    "\n",
    "# Run the query\n",
    "loader.run_query(louvain_algorithm_query, {})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "4f56b27c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query for community analysis\n",
    "community_analysis_query = '''\n",
    "MATCH (c:Customer)\n",
    "WHERE c.community IS NOT NULL\n",
    "RETURN c.community as Community, COUNT(*) as Size \n",
    "ORDER BY Size DESC\n",
    "'''\n",
    "\n",
    "# Run the query and get the results\n",
    "results = loader.run_query_and_return(community_analysis_query, {})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "dba87e30",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Loading the schema of our Graph\n",
    "schema = loader.run_query_and_return_graph(\"CALL db.schema.visualization()\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d8ce1bd4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "af504f6ba23c4ef39852d9d3fec23e31",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='500px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Visualization of the graph\n",
    "GraphWidget(graph=schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "72316fb0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Community</th>\n",
       "      <th>Size</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>33</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>70</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>88</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>34</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>82</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>6</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>7</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>8</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>12</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>15</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>20</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>21</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>22</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>25</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>28</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>32</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>39</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>42</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>44</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>45</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>47</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>48</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>49</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>51</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>53</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>55</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>56</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>57</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>59</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>61</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>63</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>68</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>69</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>71</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>72</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>74</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>76</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>79</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>81</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>83</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>84</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>87</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Community  Size\n",
       "0          33    12\n",
       "1          70    12\n",
       "2          88    12\n",
       "3          34     8\n",
       "4          82     6\n",
       "5           0     1\n",
       "6           2     1\n",
       "7           3     1\n",
       "8           4     1\n",
       "9           6     1\n",
       "10          7     1\n",
       "11          8     1\n",
       "12         12     1\n",
       "13         15     1\n",
       "14         20     1\n",
       "15         21     1\n",
       "16         22     1\n",
       "17         25     1\n",
       "18         28     1\n",
       "19         32     1\n",
       "20         39     1\n",
       "21         42     1\n",
       "22         44     1\n",
       "23         45     1\n",
       "24         47     1\n",
       "25         48     1\n",
       "26         49     1\n",
       "27         51     1\n",
       "28         53     1\n",
       "29         55     1\n",
       "30         56     1\n",
       "31         57     1\n",
       "32         59     1\n",
       "33         61     1\n",
       "34         63     1\n",
       "35         68     1\n",
       "36         69     1\n",
       "37         71     1\n",
       "38         72     1\n",
       "39         74     1\n",
       "40         76     1\n",
       "41         79     1\n",
       "42         81     1\n",
       "43         83     1\n",
       "44         84     1\n",
       "45         87     1"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "data = []\n",
    "for record in results:\n",
    "    data.append({\"Community\": record['Community'], \"Size\": record['Size']})\n",
    "df = pd.DataFrame(data)\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "a131822a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query to explore specific communities with community ID = 33\n",
    "graph = loader.run_query_and_return_graph(\"MATCH (c:Customer) WHERE c.community = 33 RETURN c\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "9ab89f37",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "8b2a951ffa0447c486c1567188f6a3b3",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='500px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Visualization of the graph\n",
    "GraphWidget(graph=graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7441e3c7",
   "metadata": {},
   "source": [
    "# RECOMMENDER SYSTEM"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "19ea835e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query to create in-memory projection of subgraph \"customer product\"\n",
    "project_graph_query1 = '''\n",
    "CALL gds.graph.project(\n",
    "    'customer_product_graph',\n",
    "    {\n",
    "        Customer: {\n",
    "            label: 'Customer',\n",
    "            properties: {}\n",
    "        },\n",
    "        Product: {\n",
    "            label: 'Product',\n",
    "            properties: {}\n",
    "        }\n",
    "    },\n",
    "    {\n",
    "        BUYS_PRODUCT: {\n",
    "            type: 'BUYS_PRODUCT',\n",
    "            orientation: 'UNDIRECTED',\n",
    "            properties: {}\n",
    "        }\n",
    "    }\n",
    ")\n",
    "'''\n",
    "\n",
    "# Run the query\n",
    "loader.run_query(project_graph_query1, {})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "92966e87",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initially we run the Query for Node2Vec Embedding\n",
    "node2vec_query = '''\n",
    "CALL gds.beta.node2vec.write('customer_product_graph',\n",
    "  {\n",
    "    embeddingDimension: 10,\n",
    "    walkLength: 80,\n",
    "    randomSeed: 42,\n",
    "    writeProperty: 'node2vec_embedding'\n",
    "  }\n",
    ")\n",
    "'''\n",
    "\n",
    "# Run the Node2Vec query\n",
    "loader.run_query(node2vec_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "fb61c6df",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.companyName</th>\n",
       "      <th>n.node2vec_embedding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alfreds Futterkiste</td>\n",
       "      <td>[0.014049062505364418, -0.001962334383279085, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ana Trujillo Emparedados y helados</td>\n",
       "      <td>[-0.1506243199110031, -0.7683464884757996, -0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>[0.01399531401693821, -0.0002356968616368249, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>[0.013986357487738132, 0.01671874336898327, 0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Berglunds snabbköp</td>\n",
       "      <td>[0.014013231731951237, -0.0341445729136467, 0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Blauer See Delikatessen</td>\n",
       "      <td>[-0.10955160856246948, -0.5342106223106384, -1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Blondesddsl père et fils</td>\n",
       "      <td>[0.013959481380879879, -0.032417938113212585, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>[0.013950524851679802, -0.01546349748969078, 0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Bon app'</td>\n",
       "      <td>[0.013977399095892906, 0.033673182129859924, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Bottom-Dollar Markets</td>\n",
       "      <td>[-0.05125097930431366, -1.2652692794799805, -0...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        n.companyName  \\\n",
       "0                 Alfreds Futterkiste   \n",
       "1  Ana Trujillo Emparedados y helados   \n",
       "2             Antonio Moreno Taquería   \n",
       "3                     Around the Horn   \n",
       "4                  Berglunds snabbköp   \n",
       "5             Blauer See Delikatessen   \n",
       "6            Blondesddsl père et fils   \n",
       "7           Bólido Comidas preparadas   \n",
       "8                            Bon app'   \n",
       "9               Bottom-Dollar Markets   \n",
       "\n",
       "                                n.node2vec_embedding  \n",
       "0  [0.014049062505364418, -0.001962334383279085, ...  \n",
       "1  [-0.1506243199110031, -0.7683464884757996, -0....  \n",
       "2  [0.01399531401693821, -0.0002356968616368249, ...  \n",
       "3  [0.013986357487738132, 0.01671874336898327, 0....  \n",
       "4  [0.014013231731951237, -0.0341445729136467, 0....  \n",
       "5  [-0.10955160856246948, -0.5342106223106384, -1...  \n",
       "6  [0.013959481380879879, -0.032417938113212585, ...  \n",
       "7  [0.013950524851679802, -0.01546349748969078, 0...  \n",
       "8  [0.013977399095892906, 0.033673182129859924, -...  \n",
       "9  [-0.05125097930431366, -1.2652692794799805, -0...  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "# Query to get the embeddings\n",
    "get_embeddings_query = '''\n",
    "MATCH (n:Customer)\n",
    "RETURN n.companyName, n.node2vec_embedding\n",
    "LIMIT 10;\n",
    "'''\n",
    "\n",
    "# Run the query and get the results\n",
    "results = loader.run_query_and_return(get_embeddings_query, {})\n",
    "\n",
    "# Print the embeddings\n",
    "# Convert the results to a list of dictionaries\n",
    "records = [dict(record) for record in results]\n",
    "\n",
    "# Convert the list of dictionaries to a Pandas DataFrame\n",
    "df = pd.DataFrame(records)\n",
    "\n",
    "# Display the DataFrame in Jupyter Notebook\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "aeb066bc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.productName</th>\n",
       "      <th>p.node2vec_embedding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Chai</td>\n",
       "      <td>[-0.17347189784049988, -1.37179696559906, -0.3...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chang</td>\n",
       "      <td>[0.1381937563419342, -1.3769621849060059, -0.8...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>[-0.08183262497186661, -1.1888643503189087, 0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Chef Anton's Cajun Seasoning</td>\n",
       "      <td>[0.1246376484632492, -1.7254425287246704, -0.2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Chef Anton's Gumbo Mix</td>\n",
       "      <td>[0.1334913820028305, -1.091832160949707, -0.32...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Grandma's Boysenberry Spread</td>\n",
       "      <td>[-0.48367130756378174, -0.8422445058822632, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Uncle Bob's Organic Dried Pears</td>\n",
       "      <td>[-0.02449006959795952, -0.9355024695396423, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Northwoods Cranberry Sauce</td>\n",
       "      <td>[0.024189669638872147, 0.005612008273601532, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Mishi Kobe Niku</td>\n",
       "      <td>[0.024180712178349495, 0.022566447034478188, 0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Ikura</td>\n",
       "      <td>[-0.10931035876274109, -0.7461543083190918, -0...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                     p.productName  \\\n",
       "0                             Chai   \n",
       "1                            Chang   \n",
       "2                    Aniseed Syrup   \n",
       "3     Chef Anton's Cajun Seasoning   \n",
       "4           Chef Anton's Gumbo Mix   \n",
       "5     Grandma's Boysenberry Spread   \n",
       "6  Uncle Bob's Organic Dried Pears   \n",
       "7       Northwoods Cranberry Sauce   \n",
       "8                  Mishi Kobe Niku   \n",
       "9                            Ikura   \n",
       "\n",
       "                                p.node2vec_embedding  \n",
       "0  [-0.17347189784049988, -1.37179696559906, -0.3...  \n",
       "1  [0.1381937563419342, -1.3769621849060059, -0.8...  \n",
       "2  [-0.08183262497186661, -1.1888643503189087, 0....  \n",
       "3  [0.1246376484632492, -1.7254425287246704, -0.2...  \n",
       "4  [0.1334913820028305, -1.091832160949707, -0.32...  \n",
       "5  [-0.48367130756378174, -0.8422445058822632, -0...  \n",
       "6  [-0.02449006959795952, -0.9355024695396423, -0...  \n",
       "7  [0.024189669638872147, 0.005612008273601532, -...  \n",
       "8  [0.024180712178349495, 0.022566447034478188, 0...  \n",
       "9  [-0.10931035876274109, -0.7461543083190918, -0...  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query to get the embeddings\n",
    "get_embeddings_query = '''\n",
    "MATCH (p:Product)\n",
    "RETURN p.productName, p.node2vec_embedding\n",
    "LIMIT 10;\n",
    "'''\n",
    "\n",
    "# Run the query and get the results\n",
    "results = loader.run_query_and_return(get_embeddings_query, {})\n",
    "\n",
    "# Print the embeddings\n",
    "# Convert the results to a list of dictionaries\n",
    "records = [dict(record) for record in results]\n",
    "\n",
    "# Convert the list of dictionaries to a Pandas DataFrame\n",
    "df = pd.DataFrame(records)\n",
    "\n",
    "# Display the DataFrame in Jupyter Notebook\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "06734abc",
   "metadata": {},
   "outputs": [],
   "source": [
    "knn_query = '''\n",
    "CALL gds.knn.write('customer_product_graph', {\n",
    "    topK: 5,\n",
    "    nodeProperties: ['node2vec_embedding'],\n",
    "    randomSeed: 42,\n",
    "    concurrency: 1,\n",
    "    sampleRate: 1.0,\n",
    "    deltaThreshold: 0.0,\n",
    "    writeRelationshipType: \"node2vec_SIMILAR\",\n",
    "    writeProperty: \"score\"\n",
    "})\n",
    "'''\n",
    "\n",
    "# Run the query\n",
    "loader.run_query(knn_query, {})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "fba8d9ed",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Customer1</th>\n",
       "      <th>Customer2</th>\n",
       "      <th>similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Blauer See Delikatessen</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>0.989601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Blauer See Delikatessen</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>0.989601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Blauer See Delikatessen</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>0.989601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Blauer See Delikatessen</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>0.989601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Blauer See Delikatessen</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>0.989601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>609</th>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>Queen Cozinha</td>\n",
       "      <td>0.657635</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>610</th>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Rancho grande</td>\n",
       "      <td>0.657403</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>611</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Gourmet Lanchonetes</td>\n",
       "      <td>0.657118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>612</th>\n",
       "      <td>Let's Stop N Shop</td>\n",
       "      <td>Santé Gourmet</td>\n",
       "      <td>0.637836</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>613</th>\n",
       "      <td>Let's Stop N Shop</td>\n",
       "      <td>Seven Seas Imports</td>\n",
       "      <td>0.635116</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>614 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                   Customer1             Customer2  similarity\n",
       "0    Blauer See Delikatessen  Spécialités du monde    0.989601\n",
       "1    Blauer See Delikatessen  Spécialités du monde    0.989601\n",
       "2    Blauer See Delikatessen  Spécialités du monde    0.989601\n",
       "3    Blauer See Delikatessen  Spécialités du monde    0.989601\n",
       "4    Blauer See Delikatessen  Spécialités du monde    0.989601\n",
       "..                       ...                   ...         ...\n",
       "609     Lazy K Kountry Store         Queen Cozinha    0.657635\n",
       "610   Océano Atlántico Ltda.         Rancho grande    0.657403\n",
       "611  Antonio Moreno Taquería   Gourmet Lanchonetes    0.657118\n",
       "612        Let's Stop N Shop         Santé Gourmet    0.637836\n",
       "613        Let's Stop N Shop    Seven Seas Imports    0.635116\n",
       "\n",
       "[614 rows x 3 columns]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "# Query to find similar customers based on Node2Vec embeddings\n",
    "similar_customers_query = '''\n",
    "MATCH (n:Customer)-[r:node2vec_SIMILAR]->(m:Customer)\n",
    "WHERE id(n) < id(m) OR (id(n) = id(m) AND n.companyName < m.companyName) \n",
    "RETURN n.companyName as Customer1, m.companyName as Customer2, r.score as similarity\n",
    "ORDER BY similarity DESC, Customer1, Customer2\n",
    "'''\n",
    "\n",
    "# Run the query and get the results\n",
    "results = loader.run_query_and_return(similar_customers_query, {})\n",
    "\n",
    "# Convert the results to a Pandas DataFrame\n",
    "df = pd.DataFrame([dict(record) for record in results])\n",
    "\n",
    "# Display the DataFrame in Jupyter Notebook\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "9a682974",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>RecommendedProduct</th>\n",
       "      <th>ProductCategory</th>\n",
       "      <th>NumOfSimilarCustomers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alice Mutton</td>\n",
       "      <td>Meat/Poultry</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chai</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Côte de Blaye</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Flotemysost</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Gorgonzola Telino</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Raclette Courdavault</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Steeleye Stout</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Boston Crab Meat</td>\n",
       "      <td>Seafood</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Chang</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Chef Anton's Cajun Seasoning</td>\n",
       "      <td>Condiments</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             RecommendedProduct ProductCategory  NumOfSimilarCustomers\n",
       "0                  Alice Mutton    Meat/Poultry                      2\n",
       "1                          Chai       Beverages                      2\n",
       "2                 Côte de Blaye       Beverages                      2\n",
       "3                   Flotemysost  Dairy Products                      2\n",
       "4             Gorgonzola Telino  Dairy Products                      2\n",
       "5          Raclette Courdavault  Dairy Products                      2\n",
       "6                Steeleye Stout       Beverages                      2\n",
       "7              Boston Crab Meat         Seafood                      1\n",
       "8                         Chang       Beverages                      1\n",
       "9  Chef Anton's Cajun Seasoning      Condiments                      1"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query to identify products purchased by similar customers based on a certain similarity threshold\n",
    "products_purchased_query = '''\n",
    "MATCH (target:Customer {companyName: \"Blauer See Delikatessen\"})-[r:node2vec_SIMILAR]->(similar:Customer)\n",
    "WHERE r.score > 0.8\n",
    "MATCH (similar)-[:BUYS_PRODUCT]->(product:Product)-[:PART_OF]->(category:Category)\n",
    "WHERE NOT EXISTS((target)-[:BUYS_PRODUCT]->(product))\n",
    "RETURN product.productName AS RecommendedProduct, \n",
    "       category.categoryName AS ProductCategory,\n",
    "       COUNT(DISTINCT similar) AS NumOfSimilarCustomers\n",
    "ORDER BY NumOfSimilarCustomers DESC, RecommendedProduct, ProductCategory\n",
    "LIMIT 10\n",
    "'''\n",
    "\n",
    "# Run the query and get the results\n",
    "results = loader.run_query_and_return(products_purchased_query, {})\n",
    "\n",
    "# Convert the results to a Pandas DataFrame\n",
    "df = pd.DataFrame([dict(record) for record in results])\n",
    "\n",
    "# Display the DataFrame in Jupyter Notebook\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "18000fc7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>topCategory</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Dairy Products</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      topCategory\n",
       "0  Dairy Products"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query to identify the most preferred category for a specific customer\n",
    "preferred_category_query = '''\n",
    "MATCH (customer:Customer {companyName: \"Blauer See Delikatessen\"})-[:BUYS_PRODUCT]->(:Product)-[:PART_OF]->(category:Category)\n",
    "WITH category, COUNT(*) AS productsPurchasedCount\n",
    "ORDER BY productsPurchasedCount DESC\n",
    "LIMIT 1\n",
    "WITH category.categoryName AS topCategory\n",
    "RETURN topCategory\n",
    "'''\n",
    "\n",
    "# Run the query and get the results\n",
    "results = loader.run_query_and_return(preferred_category_query, {})\n",
    "\n",
    "# Convert the results to a Pandas DataFrame\n",
    "df = pd.DataFrame([dict(record) for record in results])\n",
    "\n",
    "# Display the DataFrame in Jupyter Notebook\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "c272fa32",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>RecommendedProduct</th>\n",
       "      <th>ProductCategory</th>\n",
       "      <th>NumOfSimilarCustomers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Flotemysost</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gorgonzola Telino</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Raclette Courdavault</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Gudbrandsdalsost</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Mozzarella di Giovanni</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Alice Mutton</td>\n",
       "      <td>Meat/Poultry</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Chai</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Côte de Blaye</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Steeleye Stout</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Boston Crab Meat</td>\n",
       "      <td>Seafood</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       RecommendedProduct ProductCategory  NumOfSimilarCustomers\n",
       "0             Flotemysost  Dairy Products                      2\n",
       "1       Gorgonzola Telino  Dairy Products                      2\n",
       "2    Raclette Courdavault  Dairy Products                      2\n",
       "3        Gudbrandsdalsost  Dairy Products                      1\n",
       "4  Mozzarella di Giovanni  Dairy Products                      1\n",
       "5            Alice Mutton    Meat/Poultry                      2\n",
       "6                    Chai       Beverages                      2\n",
       "7           Côte de Blaye       Beverages                      2\n",
       "8          Steeleye Stout       Beverages                      2\n",
       "9        Boston Crab Meat         Seafood                      1"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query to prioritize recommendations based on the most preferred category\n",
    "prioritized_recommendations_query = '''\n",
    "WITH \"Blauer See Delikatessen\" AS target_customer_name, 0.8 AS score_threshold\n",
    "MATCH (customer:Customer {companyName: target_customer_name})-[:BUYS_PRODUCT]->(:Product)-[:PART_OF]->(category:Category)\n",
    "WITH category, COUNT(*) AS productsPurchasedCount, target_customer_name, score_threshold\n",
    "ORDER BY productsPurchasedCount DESC\n",
    "LIMIT 1\n",
    "WITH category.categoryName AS topCategory, target_customer_name, score_threshold\n",
    "\n",
    "MATCH (target:Customer {companyName: target_customer_name})-[r:node2vec_SIMILAR]->(similar:Customer)\n",
    "WHERE r.score > score_threshold\n",
    "MATCH (similar)-[:BUYS_PRODUCT]->(product:Product)-[:PART_OF]->(category:Category)\n",
    "WHERE NOT EXISTS((target)-[:BUYS_PRODUCT]->(product))\n",
    "WITH product, category, COUNT(DISTINCT similar) AS NumOfSimilarCustomers, topCategory\n",
    "ORDER BY CASE WHEN category.categoryName = topCategory THEN 1 ELSE 0 END DESC,\n",
    "         NumOfSimilarCustomers DESC,\n",
    "         product.productName\n",
    "LIMIT 10\n",
    "RETURN product.productName AS RecommendedProduct,\n",
    "       category.categoryName AS ProductCategory,\n",
    "       NumOfSimilarCustomers;\n",
    "'''\n",
    "\n",
    "# Run the query and get the results\n",
    "results = loader.run_query_and_return(prioritized_recommendations_query, {})\n",
    "\n",
    "# Convert the results to a Pandas DataFrame\n",
    "df = pd.DataFrame([dict(record) for record in results])\n",
    "\n",
    "# Display the DataFrame in Jupyter Notebook\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "5fb8d211",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (c:Customer)-[:BUYS_PRODUCT]->(p:Product)\n",
      "WHERE p.productName = 'Chai'\n",
      "RETURN COUNT(c)\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'COUNT(c)': 22}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "22 people bought Chai.\n"
     ]
    }
   ],
   "source": [
    "# Run chain query\n",
    "chain_query_result = loader.run_chain_query(\"How many people bought Chai\")\n",
    "print(chain_query_result)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "179f2fbd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Product)\n",
      "RETURN DISTINCT p.productName AS Product, p.unitPrice AS Price\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'Product': 'Chai', 'Price': 18.0}, {'Product': 'Chang', 'Price': 19.0}, {'Product': 'Aniseed Syrup', 'Price': 10.0}, {'Product': \"Chef Anton's Cajun Seasoning\", 'Price': 22.0}, {'Product': \"Chef Anton's Gumbo Mix\", 'Price': 21.35}, {'Product': \"Grandma's Boysenberry Spread\", 'Price': 25.0}, {'Product': \"Uncle Bob's Organic Dried Pears\", 'Price': 30.0}, {'Product': 'Northwoods Cranberry Sauce', 'Price': 40.0}, {'Product': 'Mishi Kobe Niku', 'Price': 97.0}, {'Product': 'Ikura', 'Price': 31.0}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Sure! Here are all the distinct products along with their corresponding prices:\n",
      "\n",
      "1. Chai - $18.0\n",
      "2. Chang - $19.0\n",
      "3. Aniseed Syrup - $10.0\n",
      "4. Chef Anton's Cajun Seasoning - $22.0\n",
      "5. Chef Anton's Gumbo Mix - $21.35\n",
      "6. Grandma's Boysenberry Spread - $25.0\n",
      "7. Uncle Bob's Organic Dried Pears - $30.0\n",
      "8. Northwoods Cranberry Sauce - $40.0\n",
      "9. Mishi Kobe Niku - $97.0\n",
      "10. Ikura - $31.0\n",
      "\n",
      "I hope this helps! Let me know if there's anything else I can assist you with.\n"
     ]
    }
   ],
   "source": [
    "chain_query_result2 = loader.run_chain_query(\"I want to give me all distinct products in a column with their price in second columne\")\n",
    "print(chain_query_result2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "b54c1c83",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query to explore specific communities with community ID = 33\n",
    "graph = loader.run_query_and_return_graph(\"MATCH (p:Product)  RETURN p\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "d174ff5c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "7edf1491b1ad4ed2b255c8bd13c5160a",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='500px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Visualization of the graph\n",
    "GraphWidget(graph=graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b797c3bf",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
